//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 🎮 დავალება 1: სახელის ანალიზი
// მომხმარებელს შეყავს თავისი username სახელი.
// ამოცანა:
// 1.prompt-ით შეიყვანე სახელი
// 2.alert-ით აჩვენე:
// oრამდენი სიმბოლოა სახელში (length)
// oსახელი დიდი ასოებით (toUpperCase())
// 📌 მაგ:
// Username: scriptolog
// Length: 10

// შესრულებული #1

// let names = prompt("შეიყვანე სახელი:")
// let result = names.length
// alert("ტექსტის სიგრძე: " + result)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 🧙 დავალება 2: Magic word
// online თამაშში არსებობს საიდუმლო სიტყვა: "magic"
// ამოცანა:
// 1.მოთამაშემ უნდა შეიყვანოს სიტყვა ან სიტყვები
// 2.შეამოწმე:
// oშეიცავს თუ არა შეყვანილი ტექსტი "magic"  - (includes()გამოიყენე)
// 🎯 თუ შეიცავს დაწერე →
// "✨ ძალა გააქტიურდა!"

// ❌ თუ არა →
// "ცდა ჩაიშალა 😢"

// შესრულებული #2

// const secretWord = prompt("ჩაწერე საიდუმლო სიტყვა");
// const cleanSecretWord = secretWord.toLowerCase().trim();

// if (cleanSecretWord.includes("magic")) {
//   console.log("✨ ძალა გააქტიურდა!");
// } else {
//   console.log("ცდა ჩაიშალა 😢");
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 🏁 დავალება 3: Nickname Checker
// მოთამაშე ქმნის nickname-ს ონლაინ თამაშისთვის.
// ამოცანა:
// 1.მომხმარებელმა უნდა შეიყვანოს nickname პრომპტით.
// 2.შეამოწმე:
// oიწყება თუ არა "Pro"-ით (startsWith())
// oმთავრდება თუ არა "X"-ით (endsWith())
// 🏆 თუ ორივე სწორია →
// "🔥 ლეგენდარული nickname!"

// თუ არა →
// “უფრო cool სახელი მოიფიქრე😎"

// შესრულებული #3

// let nickname = prompt("მოიფიქრე ლეგენდარული nickname!")

// if (nickname.startsWith("Pro") && nickname.endsWith("X")) {
//     console.log("🔥 ლეგენდარული nickname!");
    
// }else {
//     console.log("უფრო cool სახელი მოიფიქრე😎");
    
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 🧩 დავალება 4: სახელის გაწმენდა
// მოთამაშე შემთხვევით წერს სახელს ცარიელი სივრცეებით.
// ამოცანა:
// 1.prompt-ით მიიღე სახელი (მაგ: " Nika ")
// 2.წაშალე ზედმეტი სივრცეები (trim())
// 3.აჩვენე გაწმენდილი შედეგი alert-ში

// შესრულებული #4

// let spaceName = prompt("სფეისების მოშორების მასტერკლასი!")
// let clearSpace = spaceName.trim()
// alert(clearSpace)

//////////////////////////////////////////////////////////////////////////////////////////////////////////////